Autodesk.Revit.DB.HostObjectUtils.GetSideFaces(Autodesk.Revit.DB.HostObject,Autodesk.Revit.DB.ShellLayerType)
Returns the major side faces for this host object.
Remarks:
This utility supports host objects whose CompoundStructure is nominally oriented vertically.  It
outputs faces which are at the boundary of the CompoundStructure (such as Walls and FaceWalls).
hostObject:
The host object.
side:
The side of the host object.
Returns:
An array of references to the faces which are on the given side of this element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This host object does not support access to side faces.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.HostObjectUtils.GetBottomFaces(Autodesk.Revit.DB.HostObject)
Returns the bottom faces for this host object.
Remarks:
This utility supports host objects whose bottom faces represent one of the boundaries
of CompoundStructure (such as roofs, floors or ceilings).
hostObject:
The host object.
Returns:
An array of references to the faces which are at the bottom of this element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This host object does not support access to top or bottom faces.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.HostObjectUtils.GetTopFaces(Autodesk.Revit.DB.HostObject)
Returns the top faces for this host object.
Remarks:
This utility supports host objects whose top faces represent one of the boundaries
of CompoundStructure (such as roofs, floors or ceilings).
hostObject:
The host object.
Returns:
An array of references to the faces which are at the top of this element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This host object does not support access to top or bottom faces.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.HostObjectUtils
These are generic host object utilities.
Since:
2012